#+TITLE: Figure Drawing II
#+AUTHOR: Chris Hogan
#+DATE: <2021-01-18 Mon> to <2021-02-07 Sun>
#+STARTUP: nologdone

* Watts Figure Drawing Phase I
** Geometric Forms
   - TODO Draw pages of ellipses
   - TODO Wrapping of forms
   - TODO Spheres
   - TODO Combine forms
   - TODO Relate ellipses (cylinder)
** Skeletal Mannequin
   - TODO Copy comic poses using skeletal mannequin
** Block Form Mannequin
   - TODO Trace over photo with block forms, then draw freehand from tracing

* Log
#+BEGIN: clocktable :scope subtree :maxlevel 6 :tags t
#+CAPTION: Clock summary at [2021-01-22 Fri 21:07]
| Tags    | Headline                                        | Time    |       |      |      |
|---------+-------------------------------------------------+---------+-------+------+------|
|         | *Total time*                                    | *21:42* |       |      |      |
|---------+-------------------------------------------------+---------+-------+------+------|
|         | Log                                             | 21:42   |       |      |      |
|         | \_  Week 1                                      |         | 21:42 |      |      |
|         | \_    <2021-01-18 Mon>                          |         |       | 6:19 |      |
| drawing | \_      Copy from Frazetta's Icon               |         |       |      | 0:46 |
| drawing | \_      Croquis cafe #372                       |         |       |      | 0:35 |
| drawing | \_      Watts Figure Drawing Phase I            |         |       |      | 4:21 |
| study   | \_      Watts Figure Drawing Phase I            |         |       |      | 0:37 |
|         | \_    <2021-01-19 Tue>                          |         |       | 4:03 |      |
| drawing | \_      Copy from Frazetta's Icon               |         |       |      | 0:45 |
| drawing | \_      Warmup - geometric forms                |         |       |      | 0:38 |
| drawing | \_      Croquis cafe #371                       |         |       |      | 0:23 |
| drawing | \_      Watts Figure Drawing Phase I -...       |         |       |      | 1:55 |
| study   | \_      Watts Figure Drawing Phase I -...       |         |       |      | 0:22 |
|         | \_    <2021-01-20 Wed>                          |         |       | 3:42 |      |
| drawing | \_      Copy from Frazetta's icon               |         |       |      | 0:52 |
| drawing | \_      Warmup - geometric forms                |         |       |      | 0:10 |
| drawing | \_      Croquis cafe #370                       |         |       |      | 0:23 |
| drawing | \_      Watts Figure Drawing Phase I -...       |         |       |      | 1:08 |
| drawing | \_      Watts Figure Drawing Phase I -...       |         |       |      | 1:09 |
|         | \_    <2021-01-21 Thu>                          |         |       | 4:03 |      |
| drawing | \_      Copy from Frazetta's Icon               |         |       |      | 0:44 |
| drawing | \_      Warmup - geometric forms                |         |       |      | 0:24 |
| drawing | \_      Croquis Cafe #369                       |         |       |      | 0:23 |
| drawing | \_      Watts Figure Drawing Phase I -...       |         |       |      | 1:00 |
| study   | \_      Watts Figure Drawing Phase I - Block... |         |       |      | 0:17 |
| drawing | \_      Watts Figure Drawing Phase I - Block... |         |       |      | 1:15 |
|         | \_    <2021-01-22 Fri>                          |         |       | 3:35 |      |
| drawing | \_      Copy from Frazetta's Icon               |         |       |      | 0:48 |
| drawing | \_      Warmup - CSI curves                     |         |       |      | 0:19 |
| drawing | \_      Croquis Cafe #368                       |         |       |      | 0:24 |
| drawing | \_      Watts Figure Drawing Phase I -...       |         |       |      | 0:41 |
| drawing | \_      Watts Figure Drawing Phase I - Block... |         |       |      | 1:23 |
#+END:
#+BEGIN: clocktable-by-tag :scope subtree :maxlevel 6 :match ("drawing" "study")
| Tag     | Headline   | Time (h)  |
|---------+------------+-----------|
| drawing | *Tag time* | *20h 26m* |
|---------+------------+-----------|
| study   | *Tag time* | *1h 16m*  |

#+END:

** Week 1
*** <2021-01-18 Mon>
**** DONE Copy from Frazetta's Icon                                 :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-18 Mon 08:09]--[2021-01-18 Mon 08:55] =>  0:46
     :END:
**** DONE Croquis cafe #372                                        :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-18 Mon 10:05]--[2021-01-18 Mon 10:40] =>  0:35
     :END:
**** DONE Watts Figure Drawing Phase I                              :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-18 Mon 18:19]--[2021-01-18 Mon 19:09] =>  0:50
     CLOCK: [2021-01-18 Mon 13:19]--[2021-01-18 Mon 15:50] =>  2:31
     CLOCK: [2021-01-18 Mon 10:51]--[2021-01-18 Mon 11:51] =>  1:00
     :END:
**** DONE Watts Figure Drawing Phase I                                :study:
     :LOGBOOK:
     CLOCK: [2021-01-18 Mon 19:11]--[2021-01-18 Mon 19:48] =>  0:37
     :END:
*** <2021-01-19 Tue>
**** DONE Copy from Frazetta's Icon                                 :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-19 Tue 06:42]--[2021-01-19 Tue 07:27] =>  0:45
     :END:
**** DONE Warmup - geometric forms                                  :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-19 Tue 18:08]--[2021-01-19 Tue 18:46] =>  0:38
     :END:
**** DONE Croquis cafe #371                                         :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-19 Tue 18:47]--[2021-01-19 Tue 19:10] =>  0:23
     :END:
**** DONE Watts Figure Drawing Phase I - Proportion study           :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-19 Tue 20:55]--[2021-01-19 Tue 21:37] =>  0:42
     CLOCK: [2021-01-19 Tue 19:18]--[2021-01-19 Tue 20:31] =>  1:13
     :END:
**** DONE Watts Figure Drawing Phase I - Skeleton Mannequin           :study:
     :LOGBOOK:
     CLOCK: [2021-01-19 Tue 20:33]--[2021-01-19 Tue 20:55] =>  0:22
     :END:
*** <2021-01-20 Wed>
**** DONE Copy from Frazetta's icon                                 :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-20 Wed 06:36]--[2021-01-20 Wed 07:28] =>  0:52
     :END:
**** DONE Warmup - geometric forms                                  :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-20 Wed 18:28]--[2021-01-20 Wed 18:38] =>  0:10
     :END:
**** DONE Croquis cafe #370                                         :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-20 Wed 18:38]--[2021-01-20 Wed 19:01] =>  0:23
     :END:
**** DONE Watts Figure Drawing Phase I - Proportion study           :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-20 Wed 19:02]--[2021-01-20 Wed 20:10] =>  1:08
     :END:
**** DONE Watts Figure Drawing Phase I - Skeleton Mannequin         :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-20 Wed 20:10]--[2021-01-20 Wed 21:19] =>  1:09
     :END:
*** <2021-01-21 Thu>
**** DONE Copy from Frazetta's Icon                                 :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-21 Thu 06:45]--[2021-01-21 Thu 07:29] =>  0:44
     :END:
**** DONE Warmup - geometric forms                                  :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-21 Thu 18:03]--[2021-01-21 Thu 18:27] =>  0:24
     :END:
**** DONE Croquis Cafe #369                                         :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-21 Thu 18:27]--[2021-01-21 Thu 18:50] =>  0:23
     :END:
**** DONE Watts Figure Drawing Phase I - Skeleton Mannequin         :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-21 Thu 18:50]--[2021-01-21 Thu 19:50] =>  1:00
     :END:
**** DONE Watts Figure Drawing Phase I - Block Form Mannequin         :study:
     :LOGBOOK:
     CLOCK: [2021-01-21 Thu 19:50]--[2021-01-21 Thu 20:07] =>  0:17
     :END:
**** DONE Watts Figure Drawing Phase I - Block Form Mannequin       :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-21 Thu 20:07]--[2021-01-21 Thu 21:22] =>  1:15
     :END:
*** <2021-01-22 Fri>
**** DONE Copy from Frazetta's Icon                                 :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-22 Fri 06:38]--[2021-01-22 Fri 07:26] =>  0:48
     :END:
**** DONE Warmup - CSI curves                                       :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-22 Fri 18:15]--[2021-01-22 Fri 18:34] =>  0:19
     :END:
**** DONE Croquis Cafe #368                                         :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-22 Fri 18:39]--[2021-01-22 Fri 19:03] =>  0:24
     :END:
**** DONE Watts Figure Drawing Phase I - Skeleton from photos       :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-22 Fri 19:03]--[2021-01-22 Fri 19:44] =>  0:41
     :END:
**** DONE Watts Figure Drawing Phase I - Block form mannequin       :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-22 Fri 19:44]--[2021-01-22 Fri 21:07] =>  1:23
     :END:
** Week 2
** Week 3
** Week 4
